#for - ეს არის  სინტაქსის შემადგენელი ნაწილი (Keyword)
# i - ეს არის საიტერაციო სცვლადის დასახელება. (შეგვიძლია მივანიჭოთ ნებისმიერი სახელი )
# in -   ეს არის სინტაქსის შემადგენელი ნაწილი (keyword)             
#range() -ეს არის ფუნქცია რომელიც არის ცვლალებადი და მისი ძირითადი დანიშნულება არის რომ გამოსახოს მოცემული სიტყვა ასო აშ რამდენიც აქვს მოცემული 
 # : -   ეს არის სინტაქსის შემადგენელი ნაწილი (keyword)  

#range()
# 1) საიდან დაიწყოს ათვლა
# 2) სადამდე გაგრძელდეს
# 3) ყოველ იტერაციაზე რამდენი ნაბიჯი






#for i in range(5,55,7):
    #print(i)

#Banana = "fruit"

#for i in range("Banana"):
    #print(i)


 
#for i in range (10):
    #print( '3 * ', i, '= ', 3 * i)





# Syntax - სინტაქსი
# flexibility - მოქნილობა
#Purpose - დანიშნულება

#     True  or  False 
#while 3>2 and 12>14:
    #print("GOABEST!")





