#1)შემქნით ფუნცქცია რომელიც არგუმენტად მიიღებს ინტეჯერს, ამ ფუნქციის დავალებაა რომ აიღოს ეს ინტეჯერი და დაგვიბრუნოს გაორმაგებული
def double_integer(n):
    return n * 20

#2)დაწერე ფუნქცია greet(name), რომელიც იღებს ადამიანის სახელს და აბრუნებს მისალმების ტექსტს
def greet(name):
    return f"გამარჯობა, {name}!"

#3)შექმენით ფუნქცია is_even(num), რომელიც ამოწმებს, არის თუ არა რიცხვი ლუწი, თუ ლუწია, აბრუნებს True, სხვა შემთხვევაში False.
def is_even(num):
    return num % 2 == 0

#4)შექმენით მარტივი ფუნქცია თქვენი სურვილით რომელსაც მისცემთ default valueს
def introduce(name="უცნობი", age=18):
    return f"გამარჯობა, მე მქვია {name} და ვარ {age} წლის."

#5)შექმენით ფუნქცია nickname(name), რომელიც არგუმენტად იღებს სახელს და აბრუნებს პირველი სამი ასო(გამოიყენეთ slicingი)
def nickname(name):
    return name[:3]
                                                                